In [1]:
import pandas as pd

In [4]:
df=pd.DataFrame({
    'city':['newyork','london','paris','tokyo','newyork','paris'],
    'price':['200','150','300','250','180','320']
})

In [7]:
df

      city price
0  newyork   200
1   london   150
2    paris   300
3    tokyo   250
4  newyork   180
5    paris   320

In [10]:
df.dtypes

city     object
price    object
dtype: object

In [11]:
df['price']=df['price'].astype(int)

In [15]:
mean_price=df.groupby('city')['price'].mean()

In [16]:
df

      city  price
0  newyork    200
1   london    150
2    paris    300
3    tokyo    250
4  newyork    180
5    paris    320

In [18]:
df['city_encoded']=df['city'].map(mean_price)
df

      city  price  city_encoded
0  newyork    200         190.0
1   london    150         150.0
2    paris    300         310.0
3    tokyo    250         250.0
4  newyork    180         190.0
5    paris    320         310.0

In [ ]:
df[['price','city_encoded']]  ## will give my model only this two features for training purpose

   price  city_encoded
0    200         190.0
1    150         150.0
2    300         310.0
3    250         250.0
4    180         190.0
5    320         310.0